# CircleLightShape Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CircleLightShape Constructor
CircleLightShape Class See Also
---
Creates a circle light shape object with 2.0' emit diameter.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public CircleLightShape()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
CircleLightShape()
```

# See Also
CircleLightShape Class
CircleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace